var value ="玫瑰,月季,董永,许仙,若曦,晴川,谢娜,李湘,孟非,乐嘉,牛奶,豆浆,保安,保镖,白菜,生菜,辣椒,芥末,金庸,古龙 ,赵敏,黄蓉,海豚," +
    "海狮,水盆,水桶,唇膏,口红,森马,以纯,烤肉,涮肉,气泡,水泡,纸巾,手帕,杭州,苏州,香港,台湾,首尔,东京,橙子,橘子,葡萄,提子,太监,人妖," +
    "蝴蝶,蜜蜂,小品,话剧,裸婚,闪婚,新年,跨年,吉他,琵琶,公交,地铁,剩女,御姐,童话,神话,作家,编剧,警察,捕快,结婚,订婚,奖牌,金牌,孟飞," +
    "乐嘉,那英,韩红,面包,蛋糕,作文,论文,油条,麻花,壁纸,贴画,枕头,抱枕, 手机,座机,同学,同桌,婚纱,喜服,老佛爷,老天爷,魔术师,魔法师," +
    "鸭舌帽,遮阳帽,双胞胎,龙凤胎,情人节,光棍节,丑小鸭,灰姑娘,富二代,高富帅,生活费,零花钱,麦克风,扩音器,郭德纲,周立波,图书馆,图书店," +
    "男朋友,前男友,洗衣粉,皂角粉,牛肉干,猪肉脯,泡泡糖,棒棒糖,小沈阳,宋小宝,土豆粉,酸辣粉,蜘蛛侠,蝙蝠侠,口香糖,木糖醇,酸菜鱼,水煮鱼," +
    "小笼包,灌汤包,薰衣草,满天星,张韶涵,王心凌,刘诗诗,刘亦菲,甄嬛传,红楼梦,甄子丹,李连杰,包青天,狄仁杰,大白兔,金丝猴,果粒橙,鲜橙多," +
    "沐浴露,沐浴盐,洗发露,护发素,自行车,电动车,班主任,辅导员,过山车,碰碰车,铁观音,碧螺春,十面埋伏,四面楚歌,成吉思汗,努尔哈赤,谢娜张杰," +
    "邓超孙俪,福尔摩斯,工藤新一,贵妃醉酒,黛玉葬花,流星花园,花样男子,神雕侠侣,天龙八部,天天向上,非诚勿扰,勇往直前,全力以赴,鱼香肉丝," +
    "四喜丸子,麻婆豆腐,皮蛋豆腐,语无伦次,词不达意,宫锁心玉,宫锁珠帘,海澜之家,阿迪达斯,推理小说,侦探小说,白发巫女,黑发魔女,参考资料," +
    "参考答案,天天兄弟,快乐家族,我告诉你,我不告诉你,鼠目寸光,井底之蛙,近视眼镜,隐形眼镜,夏家三千金,爱情睡醒了,降龙十八掌,九阴白骨爪," +
    "红烧牛肉面,香辣牛肉面,梁山伯与祝英台,罗密欧与朱丽叶,公主和七个小矮人,蛇精和七个葫芦娃,花椰菜,西兰花,眼线膏,眼线液,BB霜,粉底液," +
    "大S,小S,夜猫子,夜归人,蜘蛛侠,蜘蛛精,纯净水,矿泉水,加多宝,王老吉,避孕套,安全帽,卫生纸,卫生巾,男朋友,前男友,香港,澳门,眼睛,眼球," +
    "男厕,女厕,蒙牛,伊利,扑克,麻将,暧昧,偷情,棒子,鬼子,被子,床单,壁纸,贴画,饼干,薯片,玻璃,镜子,公交,地铁,辣椒,芥末,裸婚,闪婚,胖子,肥肉" +
    ",镜子,玻璃,蕃茄,苹果,足球,篮球,间谍,奸细,海外,华侨,夫人,太太,回答,答题,简单,简易,关心,关爱,成天,整日,经典,典型,情人,老婆,小三,二奶," +
    "围巾,围脖,混蛋,流氓,变态,色狼,韩国,泰国,橙子,橘子,恋人,基友,搜狐,搜狗,大粪,狗屎";
var value1 = "你的初吻是几岁在什么地方被什么人夺去的?你的初恋是几岁?你的初恋对象是谁?大学一共挂过几门课?大学所有考试中，你考" +
    "到最低的一门是什么课，考了几分?你吻过几个人?在现场所有同学中，你看哪位异性同学最舒服?如果再给你一次机会，回到高中毕业那天，" +
    "你最想对某一位异性说什么话?第一个喜欢的异性叫什么名字?如果过去没有的话，你现在会选哪一位作为YY对象?  对梦中情人有什么要求" +
    "（在一分钟内说出五条）?让你一直念念不忘的一位异性的名字及原因?谈过几次恋爱?每天睡觉前都会想起的人是谁?你最怕的事情或东西是" +
    "什么（说出三件）?你会不会在意ta的过去，为什么?打算什么时候结婚?现在心里最在意的异性叫什么名字?第一次爱的人对你有什么影响?" +
    "你在意你的老婆（老公）不是处女（处男）吗? 你会为了爱情牺牲一切，包括生命吗?结婚后希望生男孩还是女孩(只能选择一个，说出原因)?" +
    "和多少异性有过非恋爱的暧昧关系?你作弊使用过的最高招（呵呵，可能有的人是从来不作弊的，所以……大家提提意见）?从小到大最丢脸" +
    "出丑的事情是什么?如果明天是世界末日，你现在最想做的是什么? 如果让你从现场找一位gg/mm的话，你会选择谁，给出三个理由?如果让你" +
    "kiss现场的某一位异性，你会选择谁，为什么? 说出同寝室的人最让你受不了的习惯 ?如果看到自己最爱的人熟睡在你面前你会做什么?写首" +
    "自己最最喜爱的歌?当你最不知道穿什么颜色的时候，你会选择什么颜色?你最后悔的一件事是什么?曾经有过最被感动的事是什么?比较喜欢爸" +
    "爸还是妈妈?你最想要的5样东西?最后一次发自内心的笑是什么时候?如果给你一个机会去世界上任何一个地方旅行你会去?如果时间能倒流你希" +
    "望回到哪一时间?你心目中理想的爱人是什么样子呢?最想实现的三个愿望是什么?我在你眼里什么样?如果让你拥有一种超能力，你愿意拥有什么" +
    "呢?最喜欢哪部电影?与喜欢的人见面，想要穿成什么样?如果有来生，你选择当?最喜欢的食物是什么?如何向喜欢的人表白?如果你爱的人不爱你" +
    "怎么办?你会选择Having * * * before marriage吗?如果有一天，你生命中最重要的东西离你而去了，你会怎么办?如果从天而降99枚金币，" +
    "你的第一反应是什么?世界末日，你会幸存，并且你可以救一个人，你会怎么做?如果让你选择做一个电影中的角色，你会选谁呢?你在乎别人看" +
    "你的眼光吗?会为了众人的反对放弃自己想要的东西或人吗?你的爱人要出国，你会怎么做?在你心中谁最可信?你希望谁得到幸福?你会选择你爱" +
    "的人还是爱你的人?现在你最喜欢的人是谁?目前最大的愿望?你有恨过谁吗?远距离恋爱是否注定要分开?那么如果喜欢上一个遥远国度的人，你" +
    "是否会选择跟他走?如果有一天自己觉得自己的某一次选择是错的，可是现在已经再也无法重新来，那该怎么办?对你而言，爱情和友情哪个比较" +
    "重要?如果能预知未来，你最不希望看见的是什么?如果有一天我和你吵架，你会怎么办?我和你恋人同时约你，你会陪谁?世上真的有真爱吗,你眼" +
    "中的真爱是什么样的?你认为多交朋友的好处在哪里?哭得最伤心的是哪一次,为什么?情人节最想收到什么礼物?最珍爱的人是你右手的哪一个手指?" +
    "喜欢看什么动画片?你最不开心的时候会有什么表现?在爱情和面包中，你会选择哪个,为什么?最想感谢的人是谁?怎样看待性?想过自己以后是干什" +
    "么的吗?你的理想职业是什么?你觉得最美的画面是什么?如果跟你喜欢的人约会，碰到前任的男（女）朋友，会有什么表现?到目前为止你做过最疯" +
    "狂的事是?如果有一天我对你说我爱上你了，你怎么办?在你眼里，我是个怎样的人,我要听实话啦";

//这里有两个函数，一个是获得一个随机的词汇，一个是获得一条随机的问题

/**
 * 获得一组词汇，逗号分隔
 * @returns {string}
 */
function getwords(){
    var word="";
    var words=value.split(',');
    var num=Math.floor(Math.random()*words.length);
    if(num%2===0){
        word=words[num]+","+words[num+1];
    }else{
        word=words[num]+","+words[num-1];
    }
    return word;
}
// console.log(getwords());  //  皮蛋豆腐,麻婆豆腐


/**
 * 获得一个问题
 * @returns {string}
 */
function getquestion() {
    var questions=value1.split('?');
    var num=Math.floor(Math.random()*questions.length);
    return questions[num];
}
// console.log(getquestion());  //每天睡觉前都会想起的人是谁

//将函数方法暴露出来
module.exports={
    getwords:getwords,
    getquestion:getquestion
}
